{
    "title": "FAQPage",
    "pageType": "innerpage",
    "content": [
        {
            "id": "FAQ-section",
            "section": "FAQ-section",
            "section_title": {
                "showShortDec": false,
                "showSubTitle": true,
                "subtitle": "// FAQ.",
                "title": "Frequiently Asked Question.",
                "icon": {
                    "src": "../../data/images/icons/pencile.png",
                    "alt": "Working Process"
                },
                "dividerBg": "secondary"
            },
            "images": [
                {
                    "src": "../../data/images/faq/1.png"
                }
            ],
            "items": [
                {
                    "id": "faq-1",
                    "headings": [
                        {
                            "level": "h5",
                            "content": "What is Web 3?"
                        }
                    ],
                    "description": "Web 3.0 is the third generation of the internet that allows websites and apps to process information in a smart human-like way through technologies like machine learning (ML), big data, decentralized ledger technology (DLT), etc. Web 3.0 was originally called the Semantic Web by World Wide Web inventor Tim Berners-Lee and aimed to be a more autonomous, intelligent, and open internet."
                },
                {
                    "id": "faq-2",
                    "headings": [
                        {
                            "level": "h5",
                            "content": "How do common users and professionals see the Web3?"
                        }
                    ],
                    "description": "Ordinary users who are not professional and well-informed about Web 3.0 see the technology as a utopia Internet where everything is user-centric. The internet will be decentralized; hence the community will manage it. There won't be any corporations collecting and processing users' data without permission to earn money. The user will only voice the thought, and the internet will do it for them."
                },
                {
                    "id": "faq-3",
                    "headings": [
                        {
                            "level": "h5",
                            "content": "Why choose Saysheji as your Web3 development solution?"
                        }
                    ],
                    "description": "Our Web3 solution experts work with you to create future-ready decentralized solutions that use the potential of distributed ledger technology with real-world use cases. We are always flexible in implementing our project development methodologies to accommodate your needs."
                },
                {
                    "id": "faq-4",
                    "headings": [
                        {
                            "level": "h5",
                            "content": "What are the costs involved in developing a Web3 solution?"
                        }
                    ],
                    "description": "The solution configuration determines the price of launching a Web3 solution and the functionality required. Contact us today to receive a cost estimate for your needs."
                },
                {
                    "id": "faq-5",
                    "headings": [
                        {
                            "level": "h5",
                            "content": "How long will it take to launch a Web3 solution?"
                        }
                    ],
                    "description": "The solution's functions and features determine the time required to launch the Web 3.0 solution. The more intricate the functionality, the longer it takes to design, test, and launch it."
                }
            ]
        }
    ]
}
