[{
    "about-internship": "If you are interested in learning the essence of digital marketing and gaining valuable agency experience and knowledge, then look no further! We are looking for talented and dedicated people like you to join our team.",
    
    "digital-account-executive": [{
        "title": "Digital Account Executive",
        "about": "We are seeking high energy, intelligent and entrepreneurial individuals with great people skills to help us support the needs of the advertising community through our digital services. As a Digital Account Executive, you’ll take a hands-on approach in managing day-to-day projects, while fostering partnerships with our clients.",
        "responsibilities": [
            "Daily managing of on-going projects",
            "Client servicing, through face-to-face contact",
            "Preparing sample visuals and value proving background information, as basis for recommending digital solutions",
            "Ability to prioritize and organize work is critical"
        ],
        "skills": [
            "A keen interest in the digital industry",
            "A desire to stay updated with the latest digital platforms and technology",
            "Able to work independently and in a team",
            "Strong believer in creative ideas that work",
            "Responsible, organized, with attention to detail",
            "Outstanding communication skills, both oral and written"
        ],
        "qualification": [
            "Candidate must possess at least a Professional Certificate, Diploma, Advanced / Higher / Graduate Diploma, Bachelor’s Degree, Post Graduate Diploma, Professional Degree, Art / Design / Creative Multimedia, Advertising / Media, Business Studies / Administration / Management, Mass Communications, Marketing or equivalent.",
            "Required skill(s): Presentation Skills, Problem Solving Technique, Microsoft Office",
            "Required language(s): English, Bahasa Malaysia",
            "Preferably 1-2 years of working experience in advertising/creative/digital agency environment",
            "Possesses own transport (optional)"
        ]
    }],

    "digital-project-executive": [{
        "title": "Digital Project Executive",
        "about": "We’re looking for someone who has experience in digital project management either at an agency or client side. As a vital member of the team, you will be working on a range of clients, liaising with different internal teams, and seeing the projects through from end to end.",
        "responsibilities": [
            "Taking briefs from account servicing team and developing detailed project scopes, including objectives and deliverables",
            "Coordinating internal resources to ensure resource availability and allocation",
            "Overseeing and monitoring the progress for all projects, ensuring that all work is delivered on-time and quality standards are met",
            "Anticipating potential issues and proactively seek for solutions internally and with client",
            "Communicating with all teams to keep them up-to-date on project status and timeline"
        ],
        "skills": [
            "Possess digital knowledge or work experience in a digital agency will be a plus point",
            "Solid organizational skills including attention to detail and the ability to multi-task",
            "Excellent time management skills",
            "Strong communication skills, both written and verbal",
            "Ability to work independently and under pressure to meet deadlines",
            "Able to own individual projects as well as the ability to work within a team"
        ],
        "qualification": [
            "Candidate must possess at least a Diploma accreditation in Digital Marketing/Advertising, Business Management or relevant field",
            "At least 1 year experience in digital project management – working on campaigns from initial briefing to delivery",
            "Required language(s): English, Bahasa Malaysia",
            "Preferably 1-2 years of working experience in advertising/creative/digital agency environment",
            "Possesses own transport (optional)"
        ]
    }],

    "digital-media-planner": [{
        "title": "Digital Media Planner",
        "about": "The Digital Media Planner is a crucial position that requires an individual to work well within a team and be prepared for a fast-paced and detail-oriented environment. This individual is expected to show resourcefulness, exhibit accountability, work independently and demonstrate initiative.",
        "statement": "The candidate needs to have excellent communication skills, a broad knowledge of media channels and trends, and analytical skills. Ultimately, this role drives innovation at the campaign level and cultivates key partnerships to deliver the best digital media opportunities to the client.",
        "responsibilities": [
            "To observe the market regularly to maintain their knowledge of audience trends and consumer behavior, as well as performing competitor research to stay abreast of what marketing channels the competition is utilizing.",
            "From campaign insights and data mining to creating personas, evaluating the target demographic through the media audiences use, the times and places they consume it, and how long they view different pieces of content.",
            "Work closely with Digital Strategist, Creative Team as well as Servicing Team to understand the client’s business objectives and advertising strategy.",
            "Identify target audiences and analyze their characteristics, behavior and media habits.",
            "Recommend the most appropriate types of media to use, as well as the most effective time spans and locations.",
            "Ensuring approved planned media are placed and consistent.",
            "Maintain records and prepare periodic reports as may be required on assigned accounts.",
            "Monitor and optimize the effectiveness of campaigns.",
            "Provide regular updates and post-campaign reporting with recommendations for optimization and forward planning as required."
        ],
        "skills": [
            "Display a strong interest to push and develop new digital initiatives.",
            "Up-to-date knowledge on search, display, and social guidelines to provide recommendations for ad types, bidding models & targeting based on client briefs.",
            "Experience with Search Engine Marketing (SEM), Display and Social Media Ads especially in performance-based marketing/advertising. Familiarity with Facebook Ads, Google AdWords, Google Marketing Platform Suite, and several programmatic platforms strongly preferred.",
            "Analytical and charting ability for interpretation of statistics/data where required.",
            "Strong organizational, interpersonal, and project management skills.",
            "Digitally connected with an insatiable curiosity.",
            "Strong writing, presentation, as well as strategic and analytical thinking skills.",
            "Able to work independently and have excellent time management skills.",
            "Problem solver with the ability to develop creative solutions.",
            "Organized and detail-oriented with strong attention to follow-through.",
            "Nimble and flexible to succeed in a fast-paced environment and handle ad-hoc requests."
        ],
        "qualification": [
            "At least 3-4 years of agency or brand work experience in media planning and/or digital marketing.",
            "Possess at least Professional Certificate or above in Business Studies, Marketing, Advertising/Media or equivalent.",
            "Required language(s): English, Bahasa Malaysia",
            "Preferably 1-2 years of working experience in advertising/creative/digital agency environment",
            "Possesses own transport (optional)"
        ]
    }],

    "digital-content-writer": [{
        "title": "Digital Content Writer",
        "about": "We are on the lookout for someone to replace that line with something witty and crafty. Someone who gets to write regularly for social media platforms, banners, websites, and generally enjoy writing in that style the Internet likes. Someone who is particular about spelling and grammar, highly creative, imaginative, and confident in writing about a wide range of topics.",
        "statement": "If you’re bilingual (English & BM, English & Mandarin) or trilingual (English, BM, & Mandarin), we want you!",
        "responsibilities": [
            "Understanding client’s brief and crafting original web copy and content",
            "Brainstorming communication strategies and ideas for creative web content and branding",
            "Presenting initial ideas to the creative director which will be developed into workable concepts",
            "Familiarizing oneself with the product, target audience and competitor activities in the market",
            "Preparing content and writing copy for various social media platforms",
            "Editing or rewriting existing copy of works as necessary for ongoing digital projects",
            "Always keep up-to-date with new advertising trends and techniques as well as what’s going on in the digital industry"
        ],
        "skills": [
            "Conceptualizing and designing interfaces for various platforms with an emphasis on user experience",
            "Conducting research, mood/storyboarding, prototyping ideas",
            "Producing layouts, digital assets, graphics for animations",
            "Designing a wide variety of interactive experiences",
            "Being an integral part of the big picture",
            "Presenting innovative ideas supported by top-notch research and industry knowledge",
            "And most importantly, having fun in the process!"
        ],
        "qualification": [
            "Candidate must possess impeccable command of either English and Bahasa Malaysia, English and Mandarin, or English, Bahasa Malaysia, and Mandarin",
            "Candidate must possess at least a Professional Certificate, Diploma, or Bachelor’s degree in Mass Communications, Public Relations, Journalism, English, or relevant degree or certification",
            "At least 1 year(s) of working experience in the related field is required for this position",
            "Preferably Junior Executives specializing in copywriting, communications, or equivale"
        ]
    }],

    "digital-designer": [{
        "title": "Digital Designer",
        "about": "As a Digital Designer, you will be developing creative concepts and designs for social media content, digital banners, websites, games, mobile apps, prototyping, wireframing, and animation. If you have awesome skills in Adobe Photoshop, Illustrator, After Effects, and HTML, then you could be the piece of creativity we’re after. You will be given countless opportunities to showcase your talents, such as designing and developing rich front-end interfaces, websites, and rich media advertising that will wow consumers and help brands to grow.",
        "responsibilities": [
            "Conceptualizing and designing interfaces for various platforms with an emphasis on user experience",
            "Conducting research, mood/storyboarding, prototyping ideas",
            "Producing layouts, digital assets, graphics for animations",
            "Designing a wide variety of interactive experiences",
            "Being an integral part of the big picture",
            "Presenting innovative ideas supported by top-notch research and industry knowledge",
            "And most importantly, having fun in the process!"
        ],
        "skills": [
            "Required skill(s): Adobe Illustrator, Photoshop, After Effects, or Google Web Designer",
            "Knowledge of additional skills such as HTML5, motion graphic or animation will be a plus",
            "Strong analytical and problem-solving skills",
            "Passionate and dedicated in your work",
            "Excited and curious about learning new technology as well as the sharing of ideas",
            "Exceptional collaboration, listening, written, and verbal communication",
            "Able to work independently as well as in a team"
        ],
        "qualification": [
            "A minimum of a diploma accreditation with knowledge in Graphic Design and Web Design",
            "At least 1 year of working experience in the related field. Fresh graduates are welcome to apply as well.",
            "Required language(s): English, Bahasa Malaysia",
            "Possesses own transport (optional)"
        ]
    }],
    "videographer": [{
        "title": "Video Grapher",
        "description": "We are a leading video production house with a talented team of professionals who create high-quality visual content for a variety of clients. Our work spans across various genres including corporate, music, events, and promotional videos. We are seeking a skilled Videographer to join our team to create visually stunning content for our clients.",
        "about": "The Videographer will be responsible for planning, shooting, and editing video content for our clients. The successful candidate must have excellent skills in videography, lighting, sound recording, and editing, and be able to work independently or as part of a team. The Videographer will be responsible for producing high-quality video content that meets our clients' expectations.",
        "responsibilities": [
            "Plan and execute video shoots",
            "Operate cameras, lighting, and sound equipment to produce high-quality videos",
            "Edit video footage to create a final product that meets our clients' needs",
            "Collaborate with clients to understand their requirements and deliver the desired outcome",
            "Stay up-to-date with industry trends and technology to ensure we provide the latest video production techniques",
            "Manage equipment and ensure it is well-maintained and used properly",
            "Ensure video projects are completed on time and within budget",
            "Manage video production timelines and ensure that deadlines are met",
            "Work collaboratively with team members to create cohesive and professional content",
            "Other duties as assigned"
        ],
        "skills": [
            "Solid understanding of videography techniques, lighting, and sound recording",
            "Strong editing skills using Adobe Premiere, Final Cut Pro or similar software",
            "Experience with camera equipment, lighting and sound equipment, and editing software",
            "Knowledge of video production workflows and processes",
            "Strong communication and interpersonal skills",
            "Ability to work independently or as part of a team",
            "Ability to manage multiple projects simultaneously",
            "High attention to detail and ability to deliver projects on time and within budget"
        ],
        "qualification": [
            "A degree in Film, Video Production, or a related field is preferred but not required. Relevant experience will also be considered.",
            "Proven experience as a Videographer or similar role for at least 1 year",
            "Required language(s): English, Bahasa Malaysia",
            "Possesses own transport (optional)"
        ],
        "conclusion": "If you are a passionate and skilled Videographer looking for an exciting opportunity to join a dynamic team, please submit your resume and a link to your portfolio. We offer a competitive salary, health benefits, and opportunities for growth within the company. We look forward to hearing from you!"
    }],
    "brand-ambassador": [{
        "title": "Brand Ambassador",
        "description": "Say Sheji Group Sdn. Bhd. is a dynamic and rapidly growing company that offers a wide range of creative and innovative solutions to our clients. Our company is committed to providing exceptional customer service and we are dedicated to the professional growth and development of our employees. We are seeking a talented Brand Ambassador to represent our ThaiGood4U YouTube Channel.",
        "about": "We are seeking a Brand Ambassador to represent our ThaiGood4U YouTube Channel. The successful candidate will be responsible for creating engaging and informative content, building relationships with our audience, and promoting the ThaiGood4U brand. The ideal candidate should have a passion for Thai cuisine, a strong presence on social media platforms, and the ability to work collaboratively with a team.",
        "responsibilities": [
            "Create high-quality content for ThaiGood4U's YouTube channel, including recipe videos, cooking tips, and lifestyle content.",
            "Collaborate with the marketing team to develop and execute content strategies that align with our brand standards and objectives.",
            "Promote ThaiGood4U's YouTube channel on social media platforms, including Instagram, Facebook, and Twitter.",
            "Build relationships with our audience and engage with them through comments, messages, and other interactions.",
            "Attend events and engage with our audience in person to promote ThaiGood4U.",
            "Work collaboratively with the marketing team to analyze and report on brand performance and identify opportunities for improvement.",
            "Stay up-to-date on the latest trends and best practices in YouTube content creation and social media marketing."
        ],
        "skills": [
            "Passion for Thai cuisine and a strong interest in food content creation.",
            "Strong communication and interpersonal skills, with the ability to engage with our audience and build relationships.",
            "Experience in content creation for YouTube and social media platforms.",
            "Knowledge of YouTube algorithms and best practices for growing and engaging with an audience.",
            "Ability to work collaboratively with a team and take direction from the marketing manager.",
            "Strong organizational skills and the ability to manage multiple projects and deadlines."
        ],
        "qualification": [
            "Experience working with external partners, such as brands and influencers, is a plus.",
            "Required language(s): English, Bahasa Malaysia",
            "Possesses own transport (optional)"
        ]
    }],
    "junior-graphic-designer": [{
        "title": "Junior Graphic Designer",
        "description": "Say Sheji Group Sdn. Bhd. is a dynamic and rapidly growing company that offers a wide range of creative and innovative solutions to our clients. Our company is committed to providing exceptional customer service and we are dedicated to the professional growth and development of our employees. We are seeking a talented Junior Graphic Designer to join our ThaiGood4U YouTube Channel team in Thailand.",
        "about": "We are seeking a Junior Graphic Designer to work on our ThaiGood4U YouTube Channel team in Thailand. The successful candidate will be responsible for creating engaging and informative visual content, including video graphics, thumbnails, and social media graphics. The ideal candidate should have experience in graphic design, a passion for food content creation, and the ability to work collaboratively with a team.",
        "responsibilities": [
            "Collaborate with the content team to conceptualize and create graphics for ThaiGood4U's YouTube channel, including video graphics, thumbnails, and social media graphics.",
            "Ensure that all visual content aligns with the brand standards and objectives.",
            "Manage and maintain all visual assets, including graphic files and stock photography.",
            "Stay up-to-date on the latest graphic design trends and best practices.", 
            "Work collaboratively with the video editor to ensure that all graphics are optimized for video content.",
            "Adhere to project timelines and budgets.",
            "Collaborate with external partners and vendors as necessary."
        ],
        "skills": [
            "Proficiency in graphic design software such as Adobe Creative Suite or Sketch.",
            "Knowledge of video graphics and the ability to create graphics that are optimized for video content.",
            "Experience with social media graphics and the ability to create engaging content for various social media platforms.",
            "Ability to work collaboratively with a team and take direction from the content manager.",
            "Strong organizational skills and the ability to manage multiple projects and deadlines.",
            "Knowledge of relevant regulations and laws related to graphic design."
        ],
        "qualification": [
            "Bachelor's degree in graphic design or a related field." ,
            "At least 1-2 years of experience in graphic design, with a strong portfolio of work.",
            "Required language(s): English, Bahasa Malaysia",
            "Possesses own transport (optional)"
        ]
    }],
    "video-editor": [{
        "title": "Video Editor",
        "description": "Say Sheji Group Sdn. Bhd. is a dynamic and rapidly growing company that offers a wide range of creative and innovative solutions to our clients. Our company is committed to providing exceptional customer service and we are dedicated to the professional growth and development of our employees. We are seeking a talented Video Editor to join our ThaiGood4U YouTube Channel team in Thailand.",
        "about": "We are seeking a Video Editor to work on our ThaiGood4U YouTube Channel team in Thailand. The successful candidate will be responsible for editing and producing high-quality video content, ensuring that it aligns with the brand standards and objectives. The ideal candidate should have experience in video editing, a passion for food content creation, and the ability to work collaboratively with a team.",
        "responsibilities": [
            "Collaborate with the content team to edit and produce high-quality video content for ThaiGood4U's YouTube channel.",
            "Ensure that all video content aligns with the brand standards and objectives.",
            "Work collaboratively with the graphic designer to ensure that all graphics are optimized for video content.",
            "Manage and maintain all video assets, including footage, sound bites, and b-roll.",
            "Stay up-to-date on the latest video editing trends and best practices.",
            "Adhere to project timelines and budgets.",
            "Collaborate with external partners and vendors as necessary"
        ],
        "skills": [
            "Proficiency in video editing software such as Adobe Premiere, Final Cut Pro, or DaVinci Resolve.",
            "Knowledge of video graphics and the ability to work collaboratively with a graphic designer to ensure that all graphics are optimized for video content.",
            "Ability to work collaboratively with a team and take direction from the content manager.",
            "Strong organizational skills and the ability to manage multiple projects and deadlines.",
            "Knowledge of relevant regulations and laws related to video editing"
        ],
        "qualification": [
            "Bachelor's degree in film production, video editing, or a related field.",
            "At least 1-2 years of experience in video editing, with a strong portfolio of work.",
            "Required language(s): English, Bahasa Malaysia",
            "Possesses own transport (optional)"
        ]
    }]
}]